PART 1
?- brother(rod,X). 
    X = tod
?- sister(marge,X). 
    X = patty
?- aunt(X,patty). 
    X = bart
    X = lisa
    X = maggie
?- uncle(bart,X). 
    X = herb
?- grandfather(maggie,X). 
    X = abraham
?- granddaughter(jackie,D). 
    D = lisa
    D = maggie
?- ancestor(bart,X). 
    X = homer
    X = marge
    X = abraham
    X = jackie


PART 2
?- query2a(X).
    X = sam
    X = bill
    X = joan
?- query2b(X).
    X = lance
?- query2c(X).
    X = lisa
    X = charlie


PART 3
?- canTeach(X, Y).
    X = bill
    Y = organic

    X = bill
    Y = inorganic

    X = susan
    Y = algebra

    X = susan
    Y = calculus

?- canTeach2(X, Y).
    X = susan
    Y = algebra

    X = susan
    Y = calculus

?- canTeach3(X, Y).
    X = susan
    Y = algebra

    X = susan
    Y = calculus

    X = chuck
    Y = dynamics

    X = chuck
    Y = electromagnetism

    X = chuck
    Y = nuclear


PART 4
A A, B, C (A == 1 v A == 0) ^ (B == 1 v B == 0) ^ (C == 1 v C == 0) -> octal_code(A, B, C) 
?- octal_code(A, B, C).
    A = 0
    B = 0
    C = 0

    A = 0
    B = 0
    C = 1

    A = 0
    B = 1
    C = 0

    A = 0
    B = 1
    C = 1

    A = 1
    B = 0
    C = 0 

    A = 1
    B = 0
    C = 1

    A = 1
    B = 1
    C = 0

    A = 1
    B = 1
    C = 1
The queries are generated from back to front due to back chaining. The acendants are A, B, C so they are pushed onto the
goal stack in this order. This means that C is the first to change its value, resulting in 001. After it runs out of possibilities,
it backtracks to the next predicate on the stack, B. B then gets changed to 1 (010) before C is changed again to 1 (011). This pattern
continues, following the pattern of backtracking from back to front.


PART 5
?- mapcolor(WA,NT,SA,Q,NSW,V,T).
    NSW = blue
    NT = blue
    Q = green
    SA = red
    T = green
    V = green
    WA = green
?- WA=green, mapcolor(WA,NT,SA,Q,NSW,V,T).
    NSW = red
    NT = red
    Q = green
    SA = blue
    T = red
    V = green
    WA = green
?- WA=red, Q=green, mapcolor(WA,NT,SA,Q,NSW,V,T).
    no